src/Catalogs/Должности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Должности</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Comment>Цвет фона должности</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВЖурналеПредварительнойЗаписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПоКлассификаторуИЭМК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторДолжностей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Должности/Ext/ManagerModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Процедура создает значения по умолчанию справочника "Специализации".
// 
Процедура СоздатьЗначенияПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	МассивДолжностей = Новый Массив;
	МассивДолжностей.Добавить("Врач стоматолог-ортодонт");
	МассивДолжностей.Добавить("Врач стоматолог");
	МассивДолжностей.Добавить("Врач-стоматолог детский");
	МассивДолжностей.Добавить("Врач стоматолог-ортопед");
	МассивДолжностей.Добавить("Врач стоматолог-терапевт");
	МассивДолжностей.Добавить("Врач стоматолог-хирург");
	МассивДолжностей.Добавить("Гигиенист стоматологический");
	МассивДолжностей.Добавить("Зубной врач");
	МассивДолжностей.Добавить("Зубной техник"); 
	МассивДолжностей.Добавить("Старший зубной техник");
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Должности.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Должности КАК Должности
	|ГДЕ
	|	НЕ Должности.ПометкаУдаления
	|	И Должности.Наименование В (&МассивДолжностей)");  
	
	Запрос.УстановитьПараметр("МассивДолжностей", МассивДолжностей); 
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 И Выборка.Количество() <> МассивДолжностей.Количество() Тогда  
		Для Каждого СтрокаМ Из МассивДолжностей Цикл 
			Если Не ЗначениеЗаполнено(Выборка.Найти(СтрокаМ)) Тогда  				
				ЭлементСправочника              = Справочники.Должности.СоздатьЭлемент();
				ЭлементСправочника.Наименование = СтрокаМ; 
				Если СтрНайти(НРег(СтрокаМ),"врач") > 0 ИЛИ СтрНайти(СтрокаМ, "Гигиенист") > 0 Тогда
					ЭлементСправочника.ОтображатьВЖурналеПредварительнойЗаписи = Истина; 
				КонецЕсли; 
				Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
					ЭлементСправочника.ДолжностьПоКлассификаторуИЭМК = Справочники.КлассификаторДолжностей.НайтиПоНаименованию(СтрокаМ); 					
				КонецЕсли;  			 
				Попытка
					ЭлементСправочника.Записать(); 
				Исключение 
					ЗаписьЖурналаРегистрации("Создать должность (" + СтрокаМ + ")", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли Выборка.Количество() = 0 Тогда  
		Для Каждого СтрокаМ Из МассивДолжностей Цикл  			
			ЭлементСправочника              = Справочники.Должности.СоздатьЭлемент();
			ЭлементСправочника.Наименование = СтрокаМ; 
			Если СтрНайти(НРег(СтрокаМ),"врач") > 0 ИЛИ СтрНайти(СтрокаМ, "Гигиенист") > 0 Тогда
				ЭлементСправочника.ОтображатьВЖурналеПредварительнойЗаписи = Истина; 
			КонецЕсли;
			Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
				ЭлементСправочника.ДолжностьПоКлассификаторуИЭМК = Справочники.КлассификаторДолжностей.НайтиПоНаименованию(СтрокаМ); 					
			КонецЕсли;
			Попытка
				ЭлементСправочника.Записать();
			Исключение 
				ЗаписьЖурналаРегистрации("Создать должность (" + СтрокаМ + ")", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			КонецПопытки;
		КонецЦикла;
	КонецЕсли; 
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

#КонецОбласти
